# Лабораторная работа №3: Работа с файлами

## 📋 Описание
Программа для обработки текстовых файлов, которая анализирует каждую строку и выводит последовательность уникальных английских букв в алфавитном порядке.

## 🎯 Задание
Для каждой строки исходного файла программа определяет, каких английских букв больше - гласных или согласных, и выводит в результирующий файл соответствующие уникальные буквы в алфавитном порядке.

## 📁 Структура проекта
```
lab3/
├── lab3.c              # Исходный код программы
├── input.txt           # Пример входного файла
├── output.txt          # Пример выходного файла
└── README.md           # Этот файл
```

## 🛠 Компиляция и запуск

### Компиляция:
```bash
gcc -o lab3.exe lab3.c
```

### Запуск:
```bash
lab3.exe
```

## 📝 Формат входных данных
Входной файл содержит строки с произвольными алфавитно-цифровыми символами.

**Пример input.txt:**
```
bbad, sdiv
aaagh yd
hello123 world!
Test String with Vowels
```

## 📤 Формат выходных данных
Для каждой строки программа выводит уникальные гласные или согласные буквы в алфавитном порядке.

**Пример output.txt:**
```
bdsv
ay
hld
eio
```

## 🔍 Алгоритм работы
1. **Чтение строки** из входного файла
2. **Анализ символов**:
   - Подсчет количества гласных и согласных английских букв
   - Игнорирование цифр, пробелов и знаков препинания
3. **Принятие решения**:
   - Если гласных больше → вывод уникальных гласных
   - Если согласных больше или равно → вывод уникальных согласных
4. **Формирование результата**:
   - Только строчные буквы
   - Каждая буква только один раз
   - Буквы в алфавитном порядке

## 🎪 Пример работы

### Входная строка: `"bbad, sdiv"`
- Гласные: a, i (2 шт)
- Согласные: b, b, d, s, d, v (6 шт)
- Результат: `"bdsv"` (согласных больше)

### Входная строка: `"aaagh yd"`
- Гласные: a, a, a, y (4 шт)
- Согласные: g, h, d (3 шт)
- Результат: `"ay"` (гласных больше)

## ⚙️ Технические детали

### Используемые библиотеки:
- `stdio.h` - работа с файлами и вводом-выводом
- `stdlib.h` - системные функции
- `ctype.h` - работа с символами
- `string.h` - работа со строками
- `locale.h` - поддержка локалей

### Ключевые функции:
- `is_vowel()` - проверка на гласную букву
- `is_consonant()` - проверка на согласную букву
- `process_line()` - основная логика обработки строки
- `fgets()`/`fprintf()` - работа с файлами

## 🐛 Особенности реализации
- Поддержка русской локали (UTF-8)
- Обработка ошибок открытия файлов
- Построчный вывод процесса работы
- Автоматическое определение размера буферов

## 📚 Контрольные вопросы
1. **Функции работы с файлами** - fopen, fclose, fgets, fprintf, fgetc
2. **Директивы препроцессора** - #include, #define, макроподстановка
3. **Кодировка символов** - ASCII, UTF-8, установка локали
4. **Массивы в C** - объявление, инициализация, передача в функции